In [1]:
import pandas as pd

In [2]:
import numpy as np

In [6]:
np.random.randn(5,4)

array([[-0.42202461, -0.3285549 ,  0.99861618,  0.08085426],
       [ 0.77949555, -1.80392536,  1.31289711, -0.5005795 ],
       [-1.51500973, -0.63755801, -1.09220284, -0.42651808],
       [-1.58007932, -0.898678  ,  1.26459091,  1.63360212],
       [-0.08935304,  0.9600977 , -0.24137374, -0.46847231]])

In [4]:
df=pd.DataFrame(np.random.randn(5,4))

In [5]:
df

          0         1         2         3
0 -0.897957  1.076086  0.543034 -1.020154
1 -0.791493 -0.550938  1.445806  1.047892
2 -1.492088  0.714416 -2.440982 -0.257413
3  0.135093  0.346826  0.717349  0.247452
4  1.683954  0.167276  0.250660 -0.635974

In [7]:
"a b c d e".split()

['a', 'b', 'c', 'd', 'e']

In [8]:
df=pd.DataFrame(np.random.randn(5,4), "a b c d e".split(), 'w x y z'.split())

In [9]:
df

          w         x         y         z
a  0.093018  0.315407  1.370932 -0.389122
b  0.361682  0.448467 -0.591889  0.371387
c  0.976645 -1.970653 -2.483222 -0.096724
d  0.041897 -0.254794 -1.219839  0.901497
e  0.640704 -0.394735 -0.737211  0.548312

In [10]:
df['x']

a    0.315407
b    0.448467
c   -1.970653
d   -0.254794
e   -0.394735
Name: x, dtype: float64

In [11]:
df[['x','z']]

          x         z
a  0.315407 -0.389122
b  0.448467  0.371387
c -1.970653 -0.096724
d -0.254794  0.901497
e -0.394735  0.548312

In [13]:
df['p']=df['x']+df['z']

In [14]:
df

          w         x         y         z         p
a  0.093018  0.315407  1.370932 -0.389122 -0.073716
b  0.361682  0.448467 -0.591889  0.371387  0.819854
c  0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d  0.041897 -0.254794 -1.219839  0.901497  0.646703
e  0.640704 -0.394735 -0.737211  0.548312  0.153577

In [15]:
df['p']

a   -0.073716
b    0.819854
c   -2.067377
d    0.646703
e    0.153577
Name: p, dtype: float64

In [17]:
df.drop('p', axis=1)

          w         x         y         z
a  0.093018  0.315407  1.370932 -0.389122
b  0.361682  0.448467 -0.591889  0.371387
c  0.976645 -1.970653 -2.483222 -0.096724
d  0.041897 -0.254794 -1.219839  0.901497
e  0.640704 -0.394735 -0.737211  0.548312

In [18]:
df

          w         x         y         z         p
a  0.093018  0.315407  1.370932 -0.389122 -0.073716
b  0.361682  0.448467 -0.591889  0.371387  0.819854
c  0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d  0.041897 -0.254794 -1.219839  0.901497  0.646703
e  0.640704 -0.394735 -0.737211  0.548312  0.153577

In [19]:
df.drop('p', axis=1, inplace=True)

In [20]:
df

          w         x         y         z
a  0.093018  0.315407  1.370932 -0.389122
b  0.361682  0.448467 -0.591889  0.371387
c  0.976645 -1.970653 -2.483222 -0.096724
d  0.041897 -0.254794 -1.219839  0.901497
e  0.640704 -0.394735 -0.737211  0.548312

In [23]:
df.drop('e', inplace=True)

In [24]:
df

          w         x         y         z
a  0.093018  0.315407  1.370932 -0.389122
b  0.361682  0.448467 -0.591889  0.371387
c  0.976645 -1.970653 -2.483222 -0.096724
d  0.041897 -0.254794 -1.219839  0.901497

In [25]:
df.shape

(4, 4)

In [26]:
df['p']=df['x']+df['z']

In [27]:
df.shape

(4, 5)

In [29]:
#accising rows
df

          w         x         y         z         p
a  0.093018  0.315407  1.370932 -0.389122 -0.073716
b  0.361682  0.448467 -0.591889  0.371387  0.819854
c  0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d  0.041897 -0.254794 -1.219839  0.901497  0.646703

In [30]:
df.loc['a']

w    0.093018
x    0.315407
y    1.370932
z   -0.389122
p   -0.073716
Name: a, dtype: float64

In [31]:
df.loc[['a','c']]

          w         x         y         z         p
a  0.093018  0.315407  1.370932 -0.389122 -0.073716
c  0.976645 -1.970653 -2.483222 -0.096724 -2.067377

In [32]:
df.iloc[1]

w    0.361682
x    0.448467
y   -0.591889
z    0.371387
p    0.819854
Name: b, dtype: float64

In [33]:
df

          w         x         y         z         p
a  0.093018  0.315407  1.370932 -0.389122 -0.073716
b  0.361682  0.448467 -0.591889  0.371387  0.819854
c  0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d  0.041897 -0.254794 -1.219839  0.901497  0.646703

In [34]:
df.loc['a','w']

0.09301764338381757

In [35]:
df.loc[['a','b'],['w','y']]

          w         y
a  0.093018  1.370932
b  0.361682 -0.591889

In [36]:
df.iloc[0,0]

0.09301764338381757

In [38]:
df.iloc[1:3,1:]

          x         y         z         p
b  0.448467 -0.591889  0.371387  0.819854
c -1.970653 -2.483222 -0.096724 -2.067377

In [41]:
df.iloc[[0,1],[1,4]]

          x         p
a  0.315407 -0.073716
b  0.448467  0.819854

In [44]:
booldf=df>0

In [50]:
df

          w         x         y         z         p
a  0.093018  0.315407  1.370932 -0.389122 -0.073716
b  0.361682  0.448467 -0.591889  0.371387  0.819854
c  0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d  0.041897 -0.254794 -1.219839  0.901497  0.646703

In [45]:
booldf

      w      x      y      z      p
a  True   True   True  False  False
b  True   True  False   True   True
c  True  False  False  False  False
d  True  False  False   True   True

In [46]:
df[booldf]

          w         x         y         z         p
a  0.093018  0.315407  1.370932       NaN       NaN
b  0.361682  0.448467       NaN  0.371387  0.819854
c  0.976645       NaN       NaN       NaN       NaN
d  0.041897       NaN       NaN  0.901497  0.646703

In [48]:
booldf2=df['x']>0

In [49]:
booldf2

a     True
b     True
c    False
d    False
Name: x, dtype: bool

In [56]:
tempdf=df[booldf2]

In [58]:
tempdf[['z','p']]

          z         p
a -0.389122 -0.073716
b  0.371387  0.819854
d  0.901497  0.646703

In [59]:
df[booldf2][['z','p']]

          z         p
a -0.389122 -0.073716
b  0.371387  0.819854
d  0.901497  0.646703

In [65]:
booldf2=(df['x']>0) | (df['z']>0)

In [61]:
booldf2

a     True
b     True
c    False
d     True
dtype: bool

In [63]:
df[booldf2][['w','y']]

          w         y
a  0.093018  1.370932
b  0.361682 -0.591889
d  0.041897 -1.219839

In [75]:
df.reset_index(inplace=True)

In [76]:
df

  index         w         x         y         z         p
0     a  0.093018  0.315407  1.370932 -0.389122 -0.073716
1     b  0.361682  0.448467 -0.591889  0.371387  0.819854
2     c  0.976645 -1.970653 -2.483222 -0.096724 -2.067377
3     d  0.041897 -0.254794 -1.219839  0.901497  0.646703

In [83]:
df.set_index('index', inplace=True)

In [84]:
df

              w         x         y         z         p
index
a      0.093018  0.315407  1.370932 -0.389122 -0.073716
b      0.361682  0.448467 -0.591889  0.371387  0.819854
c      0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d      0.041897 -0.254794 -1.219839  0.901497  0.646703

In [89]:
list1 = [[1,2],[3,4],[5,6,7]]

In [90]:
pd.DataFrame(list1)

   0  1    2
0  1  2  NaN
1  3  4  NaN
2  5  6  7.0

In [91]:
#create dataframe using dictionary

In [94]:
listofdict1=[{'a':1,'b':2}, {'a':11,'b':23}, {'a':41,'b':52, 'c':56}]

In [96]:
pd.DataFrame(listofdict1, index=['a','b','c'])

    a   b     c
a   1   2   NaN
b  11  23   NaN
c  41  52  56.0

In [101]:
wser=df['w']

In [100]:
xser=df['x']

In [105]:
wser

index
a    0.093018
b    0.361682
c    0.976645
d    0.041897
Name: w, dtype: float64

In [102]:
dict1={'one':wser,'two':xser}

In [103]:
dict1

{'one': index
 a    0.093018
 b    0.361682
 c    0.976645
 d    0.041897
 Name: w, dtype: float64, 'two': index
 a    0.315407
 b    0.448467
 c   -1.970653
 d   -0.254794
 Name: x, dtype: float64}

In [104]:
pd.DataFrame(dict1)

            one       two
index
a      0.093018  0.315407
b      0.361682  0.448467
c      0.976645 -1.970653
d      0.041897 -0.254794

In [106]:
df

              w         x         y         z         p
index
a      0.093018  0.315407  1.370932 -0.389122 -0.073716
b      0.361682  0.448467 -0.591889  0.371387  0.819854
c      0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d      0.041897 -0.254794 -1.219839  0.901497  0.646703

In [112]:
df.loc['d','p']=np.nan

In [113]:
df

              w         x         y         z         p
index
a      0.093018  0.315407  1.370932 -0.389122 -0.073716
b      0.361682       NaN       NaN  0.371387  0.819854
c      0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d      0.041897 -0.254794 -1.219839  0.901497       NaN

In [114]:
df.dropna()

              w         x         y         z         p
index
a      0.093018  0.315407  1.370932 -0.389122 -0.073716
c      0.976645 -1.970653 -2.483222 -0.096724 -2.067377

In [115]:
df

              w         x         y         z         p
index
a      0.093018  0.315407  1.370932 -0.389122 -0.073716
b      0.361682       NaN       NaN  0.371387  0.819854
c      0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d      0.041897 -0.254794 -1.219839  0.901497       NaN

In [116]:
df.dropna(axis=1)

              w         z
index
a      0.093018 -0.389122
b      0.361682  0.371387
c      0.976645 -0.096724
d      0.041897  0.901497

In [117]:
df.fillna(0)

              w         x         y         z         p
index
a      0.093018  0.315407  1.370932 -0.389122 -0.073716
b      0.361682  0.000000  0.000000  0.371387  0.819854
c      0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d      0.041897 -0.254794 -1.219839  0.901497  0.000000

In [118]:
df

              w         x         y         z         p
index
a      0.093018  0.315407  1.370932 -0.389122 -0.073716
b      0.361682       NaN       NaN  0.371387  0.819854
c      0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d      0.041897 -0.254794 -1.219839  0.901497       NaN

In [120]:
df['x']=df['x'].fillna(df['x'].mean())

In [121]:
df

              w         x         y         z         p
index
a      0.093018  0.315407  1.370932 -0.389122 -0.073716
b      0.361682 -0.636680       NaN  0.371387  0.819854
c      0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d      0.041897 -0.254794 -1.219839  0.901497       NaN

In [127]:
dict1={'country':['India', 'Australia', 'WI', 'Pakistan', 'India', 'Australia', 'WI'], 'year':[2011, 2011,2011, 2011,2012, 2012, 2012], 'ranking':[1,2,3,4,1,2,4]}

In [128]:
dict1

{'country': ['India',
  'Australia',
  'WI',
  'Pakistan',
  'India',
  'Australia',
  'WI'],
 'year': [2011, 2011, 2011, 2011, 2012, 2012, 2012],
 'ranking': [1, 2, 3, 4, 1, 2, 4]}

In [129]:
cricketrankdf=pd.DataFrame(dict1)

In [130]:
cricketrankdf

     country  year  ranking
0      India  2011        1
1  Australia  2011        2
2         WI  2011        3
3   Pakistan  2011        4
4      India  2012        1
5  Australia  2012        2
6         WI  2012        4

In [132]:
bycountry=cricketrankdf.groupby('country')

In [134]:
bycountry.groups

{'Australia': Int64Index([1, 5], dtype='int64'),
 'India': Int64Index([0, 4], dtype='int64'),
 'Pakistan': Int64Index([3], dtype='int64'),
 'WI': Int64Index([2, 6], dtype='int64')}

In [135]:
bycountry.mean()

             year  ranking
country
Australia  2011.5      2.0
India      2011.5      1.0
Pakistan   2011.0      4.0
WI         2011.5      3.5

In [136]:
bycountry.std()

               year   ranking
country
Australia  0.707107  0.000000
India      0.707107  0.000000
Pakistan        NaN       NaN
WI         0.707107  0.707107

In [138]:
bycountry.sum().loc['India']

year       4023
ranking       2
Name: India, dtype: int64

In [139]:
bycountry.max()

           year  ranking
country
Australia  2012        2
India      2012        1
Pakistan   2011        4
WI         2012        4

In [140]:
df

              w         x         y         z         p
index
a      0.093018  0.315407  1.370932 -0.389122 -0.073716
b      0.361682 -0.636680       NaN  0.371387  0.819854
c      0.976645 -1.970653 -2.483222 -0.096724 -2.067377
d      0.041897 -0.254794 -1.219839  0.901497       NaN

In [141]:
df.ndim

2

In [142]:
df.shape

(4, 5)

In [143]:
df.axes

[Index(['a', 'b', 'c', 'd'], dtype='object', name='index'),
 Index(['w', 'x', 'y', 'z', 'p'], dtype='object')]

In [144]:
df.values

array([[ 0.09301764,  0.31540665,  1.37093176, -0.38912244, -0.07371579],
       [ 0.36168155, -0.63668   ,         nan,  0.37138709,  0.81985447],
       [ 0.97664513, -1.97065252, -2.48322223, -0.09672437, -2.06737688],
       [ 0.04189735, -0.25479415, -1.21983933,  0.90149741,         nan]])

In [145]:
cricketrankdf

     country  year  ranking
0      India  2011        1
1  Australia  2011        2
2         WI  2011        3
3   Pakistan  2011        4
4      India  2012        1
5  Australia  2012        2
6         WI  2012        4

In [147]:
cricketrankdf.head(3)

     country  year  ranking
0      India  2011        1
1  Australia  2011        2
2         WI  2011        3

In [149]:
cricketrankdf.tail(3)

     country  year  ranking
4      India  2012        1
5  Australia  2012        2
6         WI  2012        4

In [150]:
cricketrankdf.sum()

country    IndiaAustraliaWIPakistanIndiaAustraliaWI
year                                          14080
ranking                                          17
dtype: object

In [151]:
cricketrankdf.transpose()

             0          1     2         3      4          5     6
country  India  Australia    WI  Pakistan  India  Australia    WI
year      2011       2011  2011      2011   2012       2012  2012
ranking      1          2     3         4      1          2     4

In [152]:
cricketrankdf.std()

year       0.534522
ranking    1.272418
dtype: float64

In [155]:
cricketrankdf

     country  year  ranking
0      India  2011        1
1  Australia  2011        2
2         WI  2011        3
3   Pakistan  2011        4
4      India  2012        1
5  Australia  2012        2
6         WI  2012        4

In [164]:
for key, value in df.iteritems():
    print("key is", type(key))
    print("column value is", type(value))
    print()
    print()

key is <class 'str'>
column value is <class 'pandas.core.series.Series'>


key is <class 'str'>
column value is <class 'pandas.core.series.Series'>


key is <class 'str'>
column value is <class 'pandas.core.series.Series'>


key is <class 'str'>
column value is <class 'pandas.core.series.Series'>


key is <class 'str'>
column value is <class 'pandas.core.series.Series'>

In [161]:
for key, value in cricketrankdf.iterrows():
    print("key is", type(key))
    print("row value is", value['country'])
    print(value['ranking'])
    print()

key is <class 'int'>
row value is India
1

key is <class 'int'>
row value is Australia
2

key is <class 'int'>
row value is WI
3

key is <class 'int'>
row value is Pakistan
4

key is <class 'int'>
row value is India
1

key is <class 'int'>
row value is Australia
2

key is <class 'int'>
row value is WI
4

In [ ]:
listofrows=[...]
listofcol=[...]
df.iloc[listofrows,listofcol]

In [166]:
np.random.randint(0,100,10)

array([94, 15, 24, 95, 92, 81, 23, 67, 44, 79])

In [168]:
cricketrankdf['country']

0        India
1    Australia
2           WI
3     Pakistan
4        India
5    Australia
6           WI
Name: country, dtype: object

In [170]:
cricketrankdf.country.unique()

array(['India', 'Australia', 'WI', 'Pakistan'], dtype=object)

In [171]:
len(cricketrankdf.country.unique())

4

In [172]:
cricketrankdf.country.nunique()

4

In [173]:
cricketrankdf.country.value_counts()

WI           2
India        2
Australia    2
Pakistan     1
Name: country, dtype: int64

In [175]:
cricketrankdf

     country  year  ranking
0      India  2011        1
1  Australia  2011        2
2         WI  2011        3
3   Pakistan  2011        4
4      India  2012        1
5  Australia  2012        2
6         WI  2012        4

In [176]:
def square(x):
    return x**2

In [177]:
square(4)

16

In [184]:
cricketrankdf[['year','ranking']].apply(square)

             year  ranking
0  16354914662641        1
1  16354914662641        4
2  16354914662641        9
3  16354914662641       16
4  16387469844736        1
5  16387469844736        4
6  16387469844736       16

In [181]:
cricketrankdf

     country     year  ranking
0      India  4044121        1
1  Australia  4044121        2
2         WI  4044121        3
3   Pakistan  4044121        4
4      India  4048144        1
5  Australia  4048144        2
6         WI  4048144        4

In [182]:
cricketrankdf.columns

Index(['country', 'year', 'ranking'], dtype='object')

In [183]:
cricketrankdf.index

RangeIndex(start=0, stop=7, step=1)

In [186]:
pacificdf=pd.read_csv("C:/Users/gaura/Downloads/pacific.csv")

In [189]:
pacificdf.head()

,ID,Name,Date,Time,Event,Status,Latitude,Longitude,Maximum Wind,Minimum Pressure,...,Low Wind SW,Low Wind NW,Moderate Wind NE,Moderate Wind SE,Moderate Wind SW,Moderate Wind NW,High Wind NE,High Wind SE,High Wind SW,High Wind NW
0,EP011949,UNNAMED,19490611,0,,TS,20.2N,106.3W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
1,EP011949,UNNAMED,19490611,600,,TS,20.2N,106.4W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
2,EP011949,UNNAMED,19490611,1200,,TS,20.2N,106.7W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
3,EP011949,UNNAMED,19490611,1800,,TS,20.3N,107.7W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
4,EP011949,UNNAMED,19490612,0,,TS,20.4N,108.6W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999

In [190]:
pacificdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26137 entries, 0 to 26136
Data columns (total 22 columns):
ID                  26137 non-null object
Name                26137 non-null object
Date                26137 non-null int64
Time                26137 non-null int64
Event               26137 non-null object
Status              26137 non-null object
Latitude            26137 non-null object
Longitude           26137 non-null object
Maximum Wind        26137 non-null int64
Minimum Pressure    26137 non-null int64
Low Wind NE         26137 non-null int64
Low Wind SE         26137 non-null int64
Low Wind SW         26137 non-null int64
Low Wind NW         26137 non-null int64
Moderate Wind NE    26137 non-null int64
Moderate Wind SE    26137 non-null int64
Moderate Wind SW    26137 non-null int64
Moderate Wind NW    26137 non-null int64
High Wind NE        26137 non-null int64
High Wind SE        26137 non-null int64
High Wind SW        26137 non-null int64
High Wind NW        26137 non-null int64
dtypes: int64(16), object(6)
memory usage: 4.4+ MB

In [191]:
pacificdf.describe()

,Date,Time,Maximum Wind,Minimum Pressure,Low Wind NE,Low Wind SE,Low Wind SW,Low Wind NW,Moderate Wind NE,Moderate Wind SE,Moderate Wind SW,Moderate Wind NW,High Wind NE,High Wind SE,High Wind SW,High Wind NW
count,2.613700e+04,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000,26137.000000
mean,1.988908e+07,896.050427,48.949344,18.176225,-745.064851,-746.312125,-748.290929,-746.320542,-751.604622,-752.094923,-752.701917,-752.102957,-753.584382,-753.787160,-754.046945,-753.774534
std,1.688455e+05,672.008065,25.334450,996.896388,447.193480,444.883379,441.232953,444.939111,435.198872,434.303796,433.202389,434.291049,431.605766,431.239618,430.773515,431.263235
min,1.949061e+07,0.000000,10.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000
25%,1.976081e+07,0.000000,30.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000
50%,1.990081e+07,600.000000,45.000000,941.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000
75%,2.003092e+07,1200.000000,65.000000,1002.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000,-999.000000
max,2.015113e+07,2300.000000,185.000000,1021.000000,300.000000,270.000000,180.000000,1180.000000,150.000000,150.000000,105.000000,150.000000,100.000000,75.000000,75.000000,100.000000